# Мини-демо pandas

Этот ноутбук показывает базовые примеры работы с [pandas](https://pandas.pydata.org/): создание набора данных, просмотр содержимого и простая аналитика.

In [1]:
import pandas as pd

data = {
    "Город": ["Берлин", "Мюнхен", "Гамбург", "Кёльн"],
    "Население, млн": [3.64, 1.47, 1.84, 1.09],
    "Возраст, лет": [782, 865, 834, 2031]
}

df = pd.DataFrame(data)
df

     Город  Население, млн  Возраст, лет
0   Берлин            3.64           782
1   Мюнхен            1.47           865
2  Гамбург            1.84           834
3    Кёльн            1.09          2031

In [2]:
df.describe(include='all')

         Город  Население, млн  Возраст, лет
count        4        4.000000      4.000000
unique       4             NaN           NaN
top     Берлин             NaN           NaN
freq         1             NaN           NaN
mean       NaN        2.010000   1128.000000
std        NaN        1.128982    602.973189
min        NaN        1.090000    782.000000
25%        NaN        1.375000    821.000000
50%        NaN        1.655000    849.500000
75%        NaN        2.290000   1156.500000
max        NaN        3.640000   2031.000000

In [ ]:
sjhdfgjshdfgjhsdf

## Что посмотреть дальше
- Попробуйте изменить данные или добавить новый столбец.
- Используйте `df.plot(kind='bar')`, чтобы построить диаграмму (в Jupyter это покажет график).
- Сохраните таблицу в CSV: `df.to_csv('cities.csv', index=False)`.